ceasar_en = {
	# Lowercase Letters
	'a': 'b', 'b': 'c', 'c': 'ç', 'ç': 'd', 'd': 'e', 'e': 'f', 'f': 'g', 'g': 'ğ',
	'ğ': 'h', 'h': 'ı', 'ı': 'i', 'i': 'j', 'j': 'k', 'k': 'l', 'l': 'm', 'm': 'n',
	'n': 'o', 'o': 'ö', 'ö': 'p', 'p': 'r', 'r': 's', 's': 'ş', 'ş': 't', 't': 'u',
	'u': 'ü', 'ü': 'v', 'v': 'y', 'y': 'z', 'z': 'a',
	
	# Uppercase Letters
	'A': 'B', 'B': 'C', 'C': 'Ç', 'Ç': 'D', 'D': 'E', 'E': 'F', 'F': 'G', 'G': 'Ğ',
	'Ğ': 'H', 'H': 'I', 'I': 'İ', 'İ': 'J', 'J': 'K', 'K': 'L', 'L': 'M', 'M': 'N',
	'N': 'O', 'O': 'Ö', 'Ö': 'P', 'P': 'R', 'R': 'S', 'S': 'Ş', 'Ş': 'T', 'T': 'U',
	'U': 'Ü', 'Ü': 'V', 'V': 'Y', 'Y': 'Z', 'Z': 'A',

	# Numbers
	'0': '1', '1': '2', '2': '3', '3': '4', '4': '5', '5': '6', '6': '7', '7': '8',
	'8': '9', '9': '0',
}

ceasar_de = {
	# Lowercase Letters
	'a': 'z', 'b': 'a', 'c': 'b', 'ç': 'c', 'd': 'ç', 'e': 'd', 'f': 'e', 'g': 'f',
	'ğ': 'g', 'h': 'ğ', 'ı': 'h', 'i': 'ı', 'j': 'i', 'k': 'j', 'l': 'k', 'm': 'l',
	'n': 'm', 'o': 'n', 'ö': 'o', 'p': 'ö', 'r': 'p', 's': 'r', 'ş': 's', 't': 'ş',
	'u': 't', 'ü': 'u', 'v': 'ü', 'y': 'v', 'z': 'y',
	
	# Uppercase Letters
	'A': 'Z', 'B': 'A', 'C': 'B', 'Ç': 'C', 'D': 'Ç', 'E': 'D', 'F': 'E', 'G': 'F',
	'Ğ': 'G', 'H': 'Ğ', 'I': 'H', 'İ': 'I', 'J': 'İ', 'K': 'J', 'L': 'K', 'M': 'L',
	'N': 'M', 'O': 'N', 'Ö': 'O', 'P': 'Ö', 'R': 'P', 'S': 'R', 'Ş': 'S', 'T': 'Ş',
	'U': 'T', 'Ü': 'U', 'V': 'Ü', 'Y': 'V', 'Z': 'Y',

	# Numbers
	'0': '9', '1': '0', '2': '1', '3': '2', '4': '3', '5': '4', '6': '5', '7': '6',
	'8': '7', '9': '8',
}

def caesar(s: str, key: int, d: dict):
	s = list(s)
	for _ in range(key):
		for i, ch in enumerate(s):
			a = d.get(ch)
			if a:
				s[i] = a
	return s